package com.he.invoke;

import java.text.SimpleDateFormat;
import java.util.Date;

/**
 * @Author Yongman
 * @Date 2017/11/19
 */
public class RandomName {
    public static String base = "abcdefghijklmnopqrstuvwxyz0123456789";
    private static String firstName = "李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李李" +
            "王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王王" +
            "张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张张" +
            "刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘刘" +
            "陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈陈" +
            "杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨杨" +
            "赵赵赵赵赵赵赵赵赵赵赵赵赵赵赵" +
            "黄黄黄黄黄黄黄黄黄黄黄黄黄黄" +
            "周周周周周周周周周周周周周" +
            "吴吴吴吴吴吴吴吴吴吴吴吴吴" +
            "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费" +
            "廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮" +
            "蓝闵席季麻强贾路娄危江童颜郭梅盛林" +
            "刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯咎管卢莫经房裘缪干解应宗宣丁贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄魏加封芮羿储靳" +
            "汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘姜詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲台从鄂索咸籍赖" +
            "卓蔺屠蒙池乔阴郁胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍却璩桑桂濮牛寿" +
            "庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庚终暨居衡步都耿满弘匡国文寇广禄阙东殴殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋" +
            "沙乜养鞠须丰巢关" +
            "寇仉督子车颛孙端木巫马公西后有琴梁丘商牟佘佴伯赏南宫墨哈谯笪年爱阳佟第五言福百家姓";
    private static String girl = "秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤" +
            "珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬" +
            "茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽 ";
    private static String boy = "伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛" +
            "昌成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁" +
            "栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾楠榕风航弘";
    private static String[] userName = ("andy735757,qiqi000000,fjx1982441,rain668899,m800618127,jwj_789456,zhao831110," +
            "beijingqiu,changchang,laopengyou,nangonglei,www.菜地.com,北欧海盗Viking,123456999,wb0002052,ezhe10000,l15335803," +
            "z19850629,fly800725,fengjikou,qicaihong,shuixiang," +
            "wenfei001,zhangyang,wwwxcomcn,a7man1314,gooooogle,46604657,33010136,snys9494,h_j30000,less3366," +
            "lyd84604,cf751125,27409654,upup2010,zj_13938,满天星*^_^*,liweijie,yangkeli,hahacoon,nana1208," +
            "cs-ak-47,mail1974,zxcvzxcv,vivivivi,格格HOCKEY,ppmm_冰女儿,dhui_19,2010208,2010103,yoyo520,huoyezi," +
            "kaifeng,Suzanna,weiziji,STARTM.,aiw-520,btz1982,basc520,STARTs.,ggd_520,le625cn,solk_yt,JACKYMC," +
            "zzmmhtd,ALEXSZB,BAR斯文男生,靓女人8888,ysyg聪明了,北方寒冬的狼,善良的大灰狼,淹死的鱼oO,睡在树上的鱼,站在岸上的鱼," +
            "丢了翅膀的鱼,其名为鲲逆鳞,与世隔绝的鱼,游离状态的猫,披着狼皮的羊,牵狼逛街的羊,虎！虎！虎！,记忆中的恐龙,草原上的蚂蚱," +
            "天津上空的鹰,流口水的兔子,孤独的薰衣草,失恋的小草儿,雨在下的菊子,狮子座向日葵,pp8848,454566,fxn214,aa2020," +
            "爱晒太阳的风,风云2002,流星雨_74,101℃太阳,今夜星光灿烂,天空依然阴暗,原色阳光-3,洁娜kina,kobe菲菲,寂寞的cd机," +
            "火花7588,双色猫眼se,guojun,juanzi,tuoxie,湘江2001,云和山的彼端,长了毛的心肝,坤哥9597,爱新觉罗静静,查拉图斯特拉," +
            "巴蒂1988,aocool,cwfcwf,efg222,fmz_84,ggnnzz,jsntcj,khw_79,ncjncj,xdcyxj,xysgod,w11w1y,hsbzcb,zzzzzz," +
            "kt斯文女生,瓶子里的女人,弱智学校校长,被追杀的狼,天峰十三狼,海河里的鱼,脑震荡的猪,江湖一孤猪,会爬树的猪,窗台上的猫," +
            "叼烟斗的猫,天堂里的猫,牧羊456,愤怒的绵羊,天上的睡熊,天蝎の蝴蝶,寂寞的蚊子,雪候鸟nn,康.雪候鸟,落单的候鸟,瘦死的骆驼," +
            "精灵鼠小妹,想飞的鸭子,刺猬小可爱,一只小毛驴,带刺的玫瑰,永远的蔷薇,一片小叶子,秋天的叶子,枫叶112,s8760,流浪的疾风," +
            "水晶花之雨,飘雪的季节,炽热的冰雪,秋天的月亮,北方苍凉月,漂浮的星儿,朋友的天空,脆弱的空气,反方向的钟,童心小镜子," +
            "发动机V8,蓝色香水瓶,伤口上的盐,哭泣的键盘,maozi,xinxi,伤心太平洋,迷路的地图,滨江大道东,凡高的麦田,灰色的眼睛," +
            "富贵神仙手,记者小脚丫,坚实的臂膀,醉卧美人膝,人品太次郎,南海十三郎,则卷千兵卫,拿破伦二世,致命朱丽叶,匕首与投枪," +
            "威龙巡洋舰,大炮728,消渴止咳贴,流行性感冒,b8858,cctv2,fzdgs,GP-02,hjh_h,jllsr,yydd0,z_l_j,z-w-b,Hdwei," +
            "y5kcn,tftlj,白金圣斗士,ok小飞侠,论语之王子,飞天090,人贩子姐姐,明天坏女人,觉醒的奴隶,高智商傻子,风尘孤狼,雾风寒狼," +
            "流浪的狼,暗水天狼,南国野狼,北方网狼,江湖一狼,大漠雪狼,水中的鱼,蓝色双鱼,想飞的鱼,爱飞的鱼,溺水的鱼,流浪的鱼,爱哭的鱼," +
            "深海的鱼,飞奔的鱼,夜行神鱼,水瓶鲸鱼,极品肥猫,悠闲的猫,冰城飞狐,疯狂天虎,出林猛虎,北方的虎,小虎哦哦,踏雪寻熊,剑神暴龙," +
            "音乐虫子,刚强之虫,!海螺!,蜻蜓飞飞,树影蜗牛,狂奔蜗牛,网上蜘蛛,时空蚂蚁,神秘天蝎,风之别鹤,闲云野鹤,黄河之雁,寒潭孤雁," +
            "恋恋青鸟,蓝色飞鸟,孤独的鹰,反恐金鹰,恰似惊鸿,沙洲孤鸿,长天孤鹜,寒鸦数点,雨中飞鹭,耀华河马,妖狐藏马,北方的狗,北方的蛇," +
            "永绿草皮,天涯湘草,早春新柳,百步穿杨,丛林赤枫,叶自飘林,雾岛之樱,落泪玫瑰,开心玫瑰,江南采莲,网路昙花,彼岸蔷薇,卉儿卉儿," +
            "死亡樱花,伤花怒放,荷叶小露,随风落叶,柠檬树叶,今日斑竹,公孙束竹,清水幽萍,栩栩清风,竹影清风,天堂的风,风继续吹,风之引力," +
            "海上追风,张狂的风,风在云颠,东野牧风,黑狐无风,牧野静风,自在的风,往日随风,自由如风,淡淡的风,石映飞云,紫竹星云,风云突变," +
            "风云再起,煦风行云,沧海行云,十一月雨,零星小雨,细雨霏霏,凝固的雨,雨一直下,骤雨初晴,无边雨丝,纳兰飘雪,季节的雪,太白有雪," +
            "前田莞雪,白雪飘飘,奇冤待雪,冰洁雪儿,飞花坠雪,冰凌雪儿,雪花飞扬,燃烧的冰,玉喋霜儿,任性紫冰,晨曦骄阳,水间苍月,大侠蓝星," +
            "夜之流星,新月晨星,大漠孤星,仰望星空,雪舞银河,天气真好,蔚蓝天空,橙色天空,天马行空,东方晓晨,不夜之侯,?浪很小,力挽狂澜," +
            "飞舞月光,都市阳光,琴心剑气,陌上纤虹,雨后惊虹,尘土飞扬,闪电光芒,海市蜃楼,清水美人,馨儿微安,简单萱萱,雨婷雨婷,簸箕簸箕," +
            "蓝色手表,机器零件,黑白天平,透明罐子,玻璃耗子,水晶叶子,发条兔子,外挂滤镜,塑料荷花,wawa,上善若水,行云流水,绿水悠悠," +
            "幽幽蓝水,流动的水,平镜海岸,我爱黄河,枫林火山,梦想之巅,梦海之巅,海内比邻,鬼谷幽道,多情沙滩,天涯海角,北国风光,橙色荷兰," +
            "承德露露,cccp,没有蛀牙,怀恋头发,长发飘飘,第三只眼,冰冷的唇,中指朝哪,欧阳费劲,东方消沉,东方聊天,令狐帅帅,上官小仙," +
            "农民卡尔,大门五郎,小泽健次,伊藤英明,唐僧gg,车寅次郎,轩辕黄帝,虹一法师,苏格拉底,亨利八世,莎士比亚,道拉格斯,卡西莫多," +
            "骑天大圣,好兵帅克,刻舟求剑,依天舞戟,西风断刀,文风如刀,老炮13,百万雄师,鸡毛令箭,后悔有药,绯雨闲丸,健康之友,肾掉打下," +
            "运动医学,aljj,bx99,TACO,we45,xxys,txwd,TMBD,nnoo,影子杀手,蒙面行者,饮风游侠,少侠一号,神雕大侠,有爱游侠,胖子侠客," +
            "雨夜故客,世纪过客,闲散过客,天涯孤客,大内密探,香香公主,青蛙公主,皮蛋公主,槟榔王子,幽境王子,吹萧公子,情歌王子,忧郁王子," +
            "倪二公子,另类女生,透明女生,银河女生,薄荷女生,占美妹妹,文清姐姐,西子姑娘,拇指姑娘,红颜知己,白兔先生,倒影先生,风云男子," +
            "粉色男人,一般男人,北方的郎,津城帅哥,放浪兄弟,楚国小生,追梦小子,好穷小子,流星小子,邢国小子,飞腾小子,咱爸咱妈,找乐天使," +
            "马路天使,飚风天使,极度天使,妖翼天使,折翼天使,堕落天使,碧波仙子,芙蓉仙子,紫霞仙子,黯然骗子,蝇木花盗,我是流氓,恐怖精英," +
            "极度痞子,一代球痞,文学痞子,好摄之徒,消息贩子,江南地主,板砖手甲,一品石匠,笨鸟先生,智障人士,上海神经,确实色盲,狂人癫语," +
            "不醒人士,中国患者,街头诗人,流浪文人,风雨哲人,化乙散人,水西散人,喜大狼,山中狼,伤心狼,李小狼,豆豆鱼,鱼尾巴,嘟嘟鱼,岸上鱼," +
            "冷冰鱼,章小鱼,半死鱼,嘉楠鱼,蝈蝈鱼,黑鱼崽,翻车鱼,鱼啊鱼,小鲜鱼,卷毛猪,虫虫猪,小肥猪,飞小猪,机器猫,斑点猫,大猫咪,小黑猫," +
            "逍遥猫,可子猫,小狐狸,小美狐,宝贝狐,狐狸精,千面狐,肥羊羔,啤啤熊,园园熊,维尼熊,霸王龙,瞌睡龙,多多龙,风云龙,化骨龙,小恐龙," +
            "泡泡龙,小虫虫,老蛀虫,千年虫,东东虫,鱼虫子,萤火虫,梦蝴蝶,玉蝴蝶,蚕宝宝,香雪螺,竹蜻蜓,小蜗牛,豌豆蛛,荆棘鸟,林中鸟,红头鸟," +
            "月月鸟,金翅雕,姬冰燕,火凤凰,大傻兔,汤耗子,戴小鼠,小老鼠,冰松鼠,小鳄鱼,嘟嘟马,大青马,可乐鸭,小飞象,小虾米,金蛇君,鸭一嘴," +
            "皮皮虾,解忧草,紫色草,车前草,彼岸草,星星草,兰花草,彩叶草,老榕树,独叶树,古松树,?玫瑰,郁金香,罂粟花,夏侯兰,洛神花,紫丁香," +
            "蒲公英,香焦叶,叶仙儿,风信子,豆豆蔓,白木瓜,甘蓝子,马喜藻,槲寄生,零零幺,爆一点,南来风,沉默风,笑凌风,悠悠云,天业云,步惊云," +
            "雨在下,小小雨,毛毛雨,痞子雨,秋天雨,暮成雪,天之雪,南极雪,雪清爽,雪千寻,百里冰,薄荷冰,红豆冰,寒&霜,水莲雾,凌云露,余夕阳," +
            "红月亮,水中月,冰雨星,木卫三,月日天,易帧天,小乐天,夏之夜,PK光,沙尘暴,安琪儿,娴雨婷,相奈儿,蓝齐儿,电灯泡,小榔头,救生圈," +
            "红铃铛,花心筒,哈哈镜,黄书包,纸菊花,水之印,千千结,冰箱^,天样纸,红丝砚,吧吧炉,水啊水,春江水,舒适海,风影海,天堂海,百里溪," +
            "大雪山,爱苍山,唐晨峰,宝剑峰,江城子,流泪谷,死亡谷,杨柳岸,池塘边,沙漠超,一品泉,潭深深,鼓浪屿,蒋南亚,神州行,纳木错,英格兰," +
            "黎巴嫩,半张嘴,跷跷鼻,じ爱眉,汪艺眉,风之眼,红酥手,张大红,张无忌,李拜四,张大民,张二民,高天乐,朱维妙,孙益申,宋晓培,梁婉婷," +
            "陈良昱,凌无卿,魏风华,马可可,周子安,任莹莹,刘占宇,崔元晖,王小柔,杨建雄,杨胖胖,刘克谦,健次郎,猪小戒,公子襄,本拉登,奥力芙," +
            "卡内基,王治郅,施连志,张效瑞,帅根伟,西门庆,周润发,古震剑,莫名剑,魂刃斩,倚天剑,双截棍,义枫刀,风之刀,光之刃,夜带刀,笑小刀," +
            "追风箭,狙击手,东方旅,冰之旅,圣火令,核弹头,免疫针,维他命,维生素,n10,ufo,wqh,ph7,Me￡,老杀手,女特工,零零漆,追风侠," +
            "逐浪客,三剑客,海陵客,健啖客,新房客,听风客,冰王子,小男生,山里妹,猪猪妹,丫头子,加非妃,女情人,美女2,阿一哥,野小子,猫少爷," +
            "邪天使,天仙子,大海盗,采花贼,古惑仔,匪兵甲,过路人,群众甲,游客甲,观众丁,小伙计,打工仔,臭皮匠,小牧童,小哨兵,小干探,白国际," +
            "笨丫头,装淑女,林有病,风语者,饿狼,的狼,小狼,苍狼,独狼,豺狼,小鱼,酷鱼,飞鱼,白鲨,鲸鱼,海怪,海星,小猪,龙猫,睡猫,狸猫,老猫," +
            "傻猫,三猫,白狸,狐媚,狐狸,雨狐,文羊,山羊,羊羊,筠羊,文虎,酷虎,棕熊,银龙,神龙,尊龙,情兽,飞虫,冥蝶,老茧,螳螂,蝌蚪,蜘蛛,牛虻," +
            "梢雁,雁子,菜鸟,棘鸟,天鹰,海鹰,鸿鹄,小枭,效鹏,飞鸽,沙鸥,白鸦,雪兔,兔哥,良驹,快马,小狗,老狗,刺猥,小鸡,小牛,寒蟾,麋鹿,猴子," +
            "王八,小草,叶草,凌草,蓝草,海草,梧桐,雨桐,望树,水木,蓝槐,蓝杉,杉林,白枫,聂枫,白杨,森林,林子,童梅,小花,芦苇,飞叶,木棉,夜蔓," +
            "一凝,啊二,阿三,三子,左四,老五,啊六,阿七,七七,秋风,远风,夜风,寒风,蓝风,萧风,清风,天风,淳风,舜风,朔风,云曦,水云,流云,雷雨," +
            "期雨,雾雨,清雨,紫雨,冬雨,好雨,夏雪,凝雪,暴雪,萧雪,北雪,冰凝,雾水,坚冰,落日,醉阳,星星,蓝星,流星,龙星,繁星,凡星,星河,日芯," +
            "迷夜,清夜,浪涛,浪花,阳光,彩虹,虹儿,冷锋,无烟,雷雷,房凌,辐射,风旋,萍萍,雅婷,雅雅,雅楠,雅雯,稚雅,苏珊,海琳,晓瑷,容容,晶莹," +
            "黛儿,紫璇,美子,梦如,楚楚,紫嫣,梦晶,静伊,彤彤,小菲,诗婕,云馨,絮儿,颦儿,碧珊,茜茜,明慧,东美,雪婷,雨莹,痰盂,板凳,窗帘,刀片," +
            "口红,铁锤,水桶,弹簧,罐子,沙漏,铃铛,风铃,玩具,木墩,唱片,蜡烛,烟花,猫眼,伊水,秋水,水澜,流水,似水,振海,文海,云海,广海,望海," +
            "兰溪,溪乐,南河,香山,乔山,金山,江山,丘岳,极地,料峭,峭壁,原野,晓野,兰汀,孤岛,怪岛,双桥,源泉,雨界,懿州,漠河,麦嘉,大牙,三毛," +
            "黄毛,蓝眉,斗眼,四眼,九眼,木眼,蓝颜,海瞳,心儿,无心,纯唇,细腰,波波,肥肠,奕柯,范哲,范峻,苏菲,吴逸,吴雨,周鼎,凌昕,小文,小冉," +
            "子安,陈西,老杰,老明,李文,李剑,李霖,许锰,八戒,悟空,晏子,苏武,勾践,炎帝,炫烨,缪斯,摩西,乔丹,巴乔,李珊,老亮,华安,喜儿,金庸," +
            "石弓,九箭,工兵,单兵,毒药,伟哥,大壮,陈皮,大补,武士,剑士,侠客,沙客,闪客,保镖,公主,太子,球妹,菲妹,玉女,她她,辣哥,大少,菌男,宜男," +
            "天使,骗子,帮主,黑帮,翠花,飞奴,小丑,傻蛋,小笨,糊糊,老愚,哑女,哑巴,柳,1,么,2,傻,")
            .split(",");
    private static final String[] email_suffix = ("@gmail.com,@yahoo.com,@msn.com,@hotmail.com,@aol.com," +
            "@ask.com,@live.com,@qq.com,@0355.net,@163.com,@163.net,@263.net,@3721.net,@yeah.net,@googlemail.com," +
            "@126.com,@sina.com,@sohu.com,@yahoo.com.cn")
            .split(",");
    private static final String[] url_suffix = ".com,.cn,.gov,.edu,.net,.org,.int,.mil,.biz,.info".split(",");

    public static int getNum(int start, int end) {
        return (int) (Math.random() * (end - start + 1) + start);
    }

    /**
     * 返回Email
     *
     * @param lMin 最小长度
     * @param lMax 最大长度
     * @return
     */
    public static String getPassword(int lMin, int lMax) {
        int length = getNum(lMin, lMax);
        StringBuffer sb = new StringBuffer();
        for (int i = 0; i < length; i++) {
            int number = (int) (Math.random() * base.length());
            sb.append(base.charAt(number));
        }
//        sb.append(email_suffix[(int) (Math.random() * email_suffix.length)]);
        return sb.toString();
    }

    /***
     * 返回url
     * @param lMin     最小长度
     * @param lMax     最大长度
     * @return
     */
    public static String getURl(int lMin, int lMax) {
        int length = getNum(lMin, lMax);
        StringBuffer sb = new StringBuffer();
        sb.append("http://");
        for (int i = 0; i < length; i++) {
            int number = (int) (Math.random() * base.length());
            sb.append(base.charAt(number));
        }
        sb.append(url_suffix[(int) (Math.random() * url_suffix.length)]);
        return sb.toString();
    }

    /**
     * 返回手机号码
     */
    /*
     * 中国电信 2G/3G号段：133，153， 180，181，189 4G号段：173， 177 中国联通
     * 2G/3G号段：130，131，132，155，156，185，186 3G上网卡：145 4G号段：176，185 中国移动
     * 2G/3G号段：134，135，136，137，138，139，150，151，152，158，159，182，183，184 3G上网卡：147
     * 4G号段：178，184
     */
    private static String[] telFirst = ("131,132,133,134,135,136,137,138,139,145,147,150,151,152,153,155,156,157," +
            "158,159,173,175,177,176,178,180,181,182,183,184,185,186,187,188,189")
            .split(",");

    public static String getTel() {
        int index = getNum(0, telFirst.length - 1);
        String first = telFirst[index];
        String second = String.valueOf(getNum(1, 888) + 10000).substring(1);
        String thrid = String.valueOf(getNum(1, 9100) + 10000).substring(1);
        return first + second + thrid;
    }

    /**
     * 返回中文姓名
     */
    private static String name_sex = "";

    public static String getChineseName() {
        int index = getNum(0, firstName.length() - 1);
        String first = firstName.substring(index, index + 1);
        int sex = getNum(0, 1);
        String str = boy;
        int length = boy.length();
        if (sex == 0) {
            str = girl;
            length = girl.length();
            name_sex = "女";
        } else {
            name_sex = "男";
        }
        index = getNum(0, length - 1);
        String second = str.substring(index, index + 1);
        int hasThird = getNum(0, 1);
        String third = "";
        if (hasThird == 1) {
            index = getNum(0, length - 1);
            third = str.substring(index, index + 1);
        }
        return first + second + third;
    }

    /**
     * 返回地址
     *
     * @return
     */
    public static String getUserName() {
        int index = getNum(0, userName.length - 1);
        String first = userName[index];
//        String second = String.valueOf(getNum(11, 150)) + "号";
//        String third = "-" + getNum(1, 20) + "-" + getNum(1, 10);
        return first;
    }

    /**
     * 获取随机日期
     *
     * @param beginDate 起始日期，格式为：yyyy-MM-dd hh:mm:ss
     * @param endDate   结束日期，格式为：yyyy-MM-dd hh:mm:ss
     * @return
     */

    public static Date randomDate(String beginDate, String endDate) {
        try {
            SimpleDateFormat format = new SimpleDateFormat("yyyy-MM-dd hh:mm:ss");
            Date start = format.parse(beginDate);// 构造开始日期
            Date end = format.parse(endDate);// 构造结束日期
            // getTime()表示返回自 1970 年 1 月 1 日 00:00:00 GMT 以来此 Date 对象表示的毫秒数。
            if (start.getTime() >= end.getTime()) {
                return null;
            }
            long date = random(start.getTime(), end.getTime());

            return new Date(date);
        } catch (Exception e) {
            e.printStackTrace();
        }
        return null;
    }

    private static long random(long begin, long end) {
        long rtn = begin + (long) (Math.random() * (end - begin));
        // 如果返回的是开始时间和结束时间，则递归调用本函数查找随机值
        if (rtn == begin || rtn == end) {
            return random(begin, end);
        }
        return rtn;
    }

//    public static void main(String[] args) {
//        for (int i = 0; i < 100; i++) {
//            System.out.printf("%1s",getChineseName());
//            System.out.printf("%20s",getPassword(6, 10));
////            System.out.println(getTel());
////            System.out.println(randomDate("1997-01-01 00:00:00","2018-12-12 00:00:00"));
//            System.out.printf("%20s",getUserName());
////            System.out.println(getURl(3,9));
//            System.out.println();
//        }
//    }
}
